DateWithinRule.createWithinLastTwoMonths = "Files whose creation time is within the last two months";
DateAfterRule.createDateAfter = "Files whose creation time is after {0, date,MMMM d, yyyy}";
DateWithinRule.createWithinLastThreeMonths = "Files whose creation time is within the last three months";
DateBeforeRule.modDateBefore = "Files whose last modified time is before {0, date,MMMM d, yyyy}";
NameStartsWithRule.filesNamesStartWith = "Files whose names start with \"{0}\"";
DateExactlyRule.createTimeIs = "Files whose creation time is {0, date,MMMM d, yyyy}";
NameContainsRule.nameContains = "Files whose names contain \"{0}\"";
DateWithinRule.createWithinLastWeek = "Files whose creation time is within the last week";
DateWithinRule.modWithinLastTwoMonths = "Files whose last modified time is within the last two months";
DateWithinRule.modWithinLastMonth = "Files whose last modified time is within the last month";
NameEqualsRule.filesNamed = "Files named \"{0}\"";
SizeLessThanRule.sizeLessThan = "Files whose size is less than {0} KB";
DateWithinRule.createWithinLastThreeDays = "Files whose creation time is within the last three days";
NameEndsWithRule.filesNamesEndWith = "Files whose names end with {0}";
DateTodayRule.modTimeToday = "Files whose last modified time is today";
DateWithinRule.modWithinLastThreeWeeks = "Files whose last modified time is within the last three weeks";
DateWithinRule.createWithinLastTwoDays = "Files whose creation time is within the last two days";
DateWithinRule.createWithinLastSixMonths = "Files whose creation time is within the last six months";
SizeGreaterThanRule.sizeGreaterThan = "Files whose size is greater than {0} KB";
DateWithinRule.createWithinLastThreeWeeks = "Files whose creation time is within the last three weeks";
DateWithinRule.createWithinLastMonth = "Files whose creation time is within the last month";
DateAfterRule.modDateAfter = "Files whose last modified time is after {0, date,MMMM d, yyyy}";
SizeEqualsRule.sizeIs = "Files whose size is {0} KB";
DateWithinRule.modWithinLastThreeDays = "Files whose last modified time is within the last three days";
DateWithinRule.modWitinLastTwoWeeks = "Files whose last modified time is within the last two weeks";
DateWithinRule.modWithinLastDay = "Files whose last modified time is within the last day";
SubDirectoryOfRule.filesNotContainedBy = "Files that are not contained by the folder {0}";
DateWithinRule.modWithinLastThreeMonths = "Files whose last modified time is within the last three months";
DateWithinRule.modWithinLastTwoDays = "Files whose last modified time is within the last two days";
DateTodayRule.creationTimeToday = "Files whose creation time is today";
SubDirectoryOfRule.filesContainedBy = "Files that are contained by the folder {0}";
DateWithinRule.createWithinLastDay = "Files whose creation time is within the last day";
DateWithinRule.modWithinLastWeek = "Files whose last modified time is within the last week";
DateWithinRule.modWithinLastSixMonths = "Files whose last modified time is within the last six months";
DateBeforeRule.createDateBefore = "Files whose creation time is before {0, date,MMMM d, yyyy}";
ExtensionEqualsRule.extensionsAreNot = "Files whose extensions are not \"{0}\"";
ExtensionEqualsRule.extensionsAre = "Files whose extensions are \"{0}\"";
DateExactlyRule.modTimeIs = "Files whose last modified time is {0, date,MMMM d, yyyy}";
DateWithinRule.createWithinLastTwoWeeks = "Files whose creation time is within the last two weeks";
